REGIONS = ["乌鲁木齐市", "克拉玛依市", "哈密地区", "吐鲁番地区", "阿克苏地区", "喀什地区", "和田地区", "塔城地区", "阿勒泰地区", "伊犁哈萨克自治州",
           "博尔塔拉蒙古自治州", "昌吉回族自治州", "巴音郭楞蒙古自治州", "克孜勒苏柯尔克孜自治州"]
REGIONS_WITH_NIL = [["全部", nil], "乌鲁木齐市", "克拉玛依市", "哈密地区", "吐鲁番地区", "阿克苏地区", "喀什地区", "和田地区", "塔城地区", "阿勒泰地区", "伊犁哈萨克自治州",
           "博尔塔拉蒙古自治州", "昌吉回族自治州", "巴音郭楞蒙古自治州", "克孜勒苏柯尔克孜自治州"]
CATEGORY_ARRAY = ['大米', '面粉', '食用油', '蔬菜', '猪肉', '牛肉', '羊肉', '水果', '牛奶', '鸡蛋', '禽肉', '方便食品']
CATEGORY_STRING = '面粉', '食用油', '蔬菜', '猪肉', '大米', '牛肉', '羊肉', '水果', '牛奶', '鸡蛋', '禽肉', '方便食品'
CITIES_OF_REGION = {
  "乌鲁木齐市" => "乌鲁木齐市区 东山区 米东区 天山区 沙依巴克区 水磨沟区",
  "克拉玛依市" => "白碱滩区 克拉玛依区",
  "吐鲁番地区" => "高昌区 吐鲁番市区",
  "哈密地区" => "哈密市区 巴里坤哈萨克自治县",
  "阿克苏地区" => "阿克苏市 温宿县 沙雅县 阿瓦提县",
  "喀什地区" => "喀什市 巴楚县 麦盖提县 莎车县",
  "和田地区" => "和田市 和田县 皮山县 民丰县",
  "克孜勒苏柯尔克孜自治州" => "阿图什市 阿克陶县 阿合奇县 乌恰县",
  "巴音郭楞蒙古自治州" => "库尔勒市 和静县 尉犁县 且末县",
  "昌吉回族自治州" => "昌吉市 阜康市 奇台县 玛纳斯县",
  "博尔塔拉蒙古自治州" => "博乐市 阿拉山口市 精河县 温泉县",
  "塔城地区" => "塔城市 乌苏市 沙湾市 额敏县 裕民县 托里县 和布克赛尔蒙古自治县",
  "阿勒泰地区" => "阿勒泰市，布尔津县 哈巴河县 吉木乃县 福海县 富蕴县 青河县",
  "伊犁哈萨克自治州" => "伊宁市 奎屯市 霍尔果斯市 伊宁县 霍城县 巩留县 新源县 昭苏县 特克斯县 尼勒克县 察布查尔锡伯自治县"
}
